package re.sta.rt.exceptionHandling;


/*
    프로그램 오류
        프로그램이 실행 중 어떤 원인에 의해서 오작동을 하거나 비정상적으로 종료되는 경우가 있다.
        이러한 결과를 초래하는 원인을 프로그램 에러 또는 오류라고 한다.

        발생 시점에 따른 에러.
            컴파일 에러 : 컴파일 시에 발생하는 에러
            런타임 에러 : 실행 시에 발생하는 에러
            논리적 에러 : 실행은 되지만, 의도와 다르게 동작하는 에러


    자바에서는 실행 시(runtime) 발생할 수 있는 프로그램 오류를
    에러(error)와 예외(exception) 두 가지로 구분 하였다.

    에러는 메모리 부족(OuterOfMemoryError) 또는 스택오버플로우(StackOverflowError)와 같이
    일단 발생하면 복구할 수 없는 심각한 오류이고, 예외는 발생하더라도 수습될 수 있는 비교적 덜 심각하다.




 */







public class Definition {
}
