package re.sta.rt;



/*
    LINUX
    - 서버에 많이 사용되는 운영체제

    Client ---> Sever
    웹브러우저->하드웨어(Client)->하드웨어(Sever)->웹서버

    - plain 하게 프로그래밍이 가능합니다.
        ANSI C - C언어 표준


리눅스 역사, 철학
    - 리누스 토발즈가 개발
        대학에 있는 UNIX 컴퓨터를 집에 쓰고싶다
        다중 사용자, 다중작업(시분할 시스템, 멀티 태스킹)  *컴퓨터 응답시간을 최소화하기 위한 시분할 시스템.


    - GNU 프로젝트
        GNU = Gnu is Not Unix
        유닉스 운영체제를 여러 회사에서 각자 개발, 소스를 공유하지 않음.
        리차드 스톨만이란 사람이, 소스를 공개하지 않는 문화에 반발을 하여,
        초기 컴퓨터 공동체의 상호협력적인 문화로 돌아갈 것을 주장하며,
        1985년도에 GNU 선언문을 발표.
       따라서, GNU 프로젝트를 지원하기 위해 자유 소프트웨어(FSF) 설립과, GNU 공개 라이센스(GPL)라는 규약을 제공

       GPL 라이센스란?
       - GPL 프로그램은 어떤 목적으로, 어떤 형태로든 사용할 수 있지만, 사용하거나 변경된 프로그램을 다시 배포하는 경우,
         동일한 GPL 라이센스 공개를 해야함.
       - 소스오픈을 장려하기 위함.

    - GNU 프로젝트와 GNU 와 Hurd
        운영체제 개발 시도 - GNU Hurd
        운영



 */

public class SP_2021_0320 {
}
